//let string = "It's Danger" //строковый тип данных
//let -
//string - 
// = - 
//"It's Danger" - 

//alert(string)

//let integer = 10 //целчисленный тип данных

//console.log(integer) //Вывод текста в консоль сайта

//let float = 100.52 //Число с плавающей точкой
//let boolean = true // =false

//***********************************************************************************************************************************************************************************

//let num = prompt("Введите число для возведения в квадрат")

//во внутрь переменной num мы пекредаем функцию pront()
// которое принимает значение числа, вводимое внутрь браузера
//которое в дальнейшем мы буде возвлодить  в квадрат 

//num = num * 2

// + - сложение (num = num + 1) - значение переменной увеличиться на 1 
// - - выч6етание (num = num - 1) - значение переменной уменьшиться на 1 
// * - умножение (num = num * 1) - значение переменной умножается на 1 
// / - деление (num = num / 1) - значение переменной делиться на 1 
// % - взятие остатка от деления (num = num % 3) -  

//мы изменили переменную num и возвели ее в квадрат

//alert(num)

//alert выводит значение переменнгой num на экран 

//*********************************************************************************************************************************************************************************** 

//let num_First = Number(prompt("Введите первое число"))
//let num_Second = Number(prompt("Введите второе число"))

//let mid = (num_First + num_Second) / 2

//alert(mid)

//***********************************************************************************************************************************************************************************

//let num = Number(promt("Введите длину стороны квадрата"))

//com = num ** 2

//alert(com)